Documents/НачислениеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>НачислениеПоЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейНачислено</Name>
							<Comment>Дней начислено</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтимулирующийТариф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПорога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорогПорядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГраницаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотребительУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейНачислено</Name>
							<Comment>Дней начислено</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотребительУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧленовСемьи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтимулирующийТариф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорогиТарифовУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПорогиТарифовУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Порог1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порог9</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеПоЛС/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Объект.Услуги.Загрузить(ТаблицаДляЗагрузки);
	
	РассчитатьСуммыНачислений();	
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

// Процедура - обработчик команды "Заполнить".
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		Состояние(НСтр("ru='Идет расчет начислений ..."
"Пожалуйста, подождите.';uk='Йде розрахунок нарахувань ..."
"Будь ласка, зачекайте.'"));
		
		Объект.Услуги.Очистить();
		Объект.Льготы.Очистить();
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
		ПоказатьНачислениеУслуг();
		
		Состояние(НСтр("ru='Расчет начислений завершен.';uk='Розрахунок нарахувань завершений.'"));
		
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды "ЗаполнитьАвтоматически".
//
&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
	
		ТекстПредупреждения = НСтр("ru='Реквизит Здание не заполнен.';uk='Реквізит Будівля не заповнено.'"); 
		Предупреждение(ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	
	Если Объект.Услуги.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru='Таблица расчета начислений будет перезаполнена, продолжить?';uk='Таблиця розрахунку нарахувань буде перенаповнений, продовжити?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние(НСтр("ru='Идет расчет начислений ..."
"Пожалуйста, подождите.';uk='Йде розрахунок нарахувань ..."
"Будь ласка, зачекайте.'"));
	
	Объект.Услуги.Очистить();
	Объект.Льготы.Очистить();
	
	ЗаполнитьАвтоматическиНаСервере();
	
	ПоказатьНачислениеУслуг();
	
	Состояние(НСтр("ru='Расчет начислений завершен.';uk='Розрахунок нарахувань завершений.'"));
		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.ЛицевойСчет,
		|	ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Код КАК ЛицевойСчетОбъектЛицевогоСчетаКод
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Период >= &ДатаНач
		|	И ЛицевыеСчета.Период <= &ДатаКон
		|	И ЛицевыеСчета.ЛицевойСчет.Владелец = &Здание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаНач,
		|			ЛицевойСчет.Владелец = &Здание
		|				И Действует) КАК ЛицевыеСчетаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетОбъектЛицевогоСчетаКод";
		
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
//{{MRG[ <-> ]
//	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
//}}MRG[ <-> ]
	
	ТаблицаДляЗагрузки	= Запрос.Выполнить().Выгрузить();
	
	Объект.Услуги.Загрузить(ТаблицаДляЗагрузки);
	
	РассчитатьСуммыНачислений();	
	
КонецПроцедуры

// Процедура - рассчитывает суммы начислений.
//
&НаСервере
Процедура РассчитатьСуммыНачислений(ЛицевойСчет = Неопределено)
	
	СтруктураДляРасчета = Новый Структура;
	
	Если ЛицевойСчет = Неопределено Тогда
		
		ТаблицаЛицевыхСчетов = Объект.Услуги.Выгрузить();
		ТаблицаЛицевыхСчетов.Свернуть("ЛицевойСчет",);
		СтруктураДляРасчета.Вставить("ЛицевыеСчета", ТаблицаЛицевыхСчетов.ВыгрузитьКолонку("ЛицевойСчет")); 
		
	Иначе
		МассивЛицевыхСчетов = Новый Массив();
		МассивЛицевыхСчетов.Добавить(ЛицевойСчет);
		СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛицевыхСчетов); 
		
	КонецЕсли;
	
	СтруктураДляРасчета.Вставить("ПериодНачисления", Объект.ПериодНачисления);
	СтруктураДляРасчета.Вставить("Услуга", Справочники.Услуги.ПустаяСсылка()); 
	
	СтруктураДляРасчета = УчетКоммунальныхУслуг.РассчитатьСуммыНачислений(СтруктураДляРасчета);
	
	Если СтруктураДляРасчета = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУслуг = СтруктураДляРасчета.НоваяТаблицаУслуг;
	ТаблицаЛьгот = СтруктураДляРасчета.НоваяТаблицаЛьгот.Скопировать();
	
	ДнейВМесяце = День(КонецМесяца(Объект.ПериодНачисления));
	
	
	
	Если СтруктураДляРасчета.ЛицевыеСчета.Количество() > 1 Тогда
		Объект.Услуги.Загрузить(ТаблицаУслуг);
		Объект.Льготы.Загрузить(ТаблицаЛьгот);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЛьгот.ДатаКонПериодаНазначения,
		|	ТаблицаЛьгот.ДатаНачПериодаНазначения,
		|	ТаблицаЛьгот.ДнейНачислено,
		|	ТаблицаЛьгот.Количество,
		|	ТаблицаЛьгот.КоличествоРесурса,
		|	ТаблицаЛьгот.КоличествоЧленовСемьи,
		|	ТаблицаЛьгот.ЛицевойСчет,
		|	ТаблицаЛьгот.Льгота,
		|	ТаблицаЛьгот.ПотребительУслуг,
		|	ТаблицаЛьгот.ПроцентЛьготы,
		|	ТаблицаЛьгот.СтимулирующийТариф,
		|	ТаблицаЛьгот.СуммаЛьготы,
		|	ТаблицаЛьгот.Тариф,
		|	ТаблицаЛьгот.ТарифЛьгота,
		|	ТаблицаЛьгот.Услуга
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаЛьгот КАК ТаблицаЛьгот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.ДатаКонПериодаНазначения) КАК ДатаКонПериодаНазначения,
		|	МИНИМУМ(ВТ.ДатаНачПериодаНазначения) КАК ДатаНачПериодаНазначения,
		|	СУММА(ВТ.ДнейНачислено) КАК ДнейНачислено,
		|	СУММА(ВТ.КоличествоРесурса) КАК КоличествоРесурса,
		|	ВТ.КоличествоЧленовСемьи,
		|	ВТ.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ.Льгота,
		|	ВТ.ПотребительУслуг,
		|	ВТ.ПроцентЛьготы,
		|	ВТ.Тариф,
		|	ВТ.Услуга КАК Услуга,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	ВТ.СтимулирующийТариф,
		|	СУММА(ВТ.СуммаЛьготы) КАК СуммаЛьготы,
		|	ВТ.ТарифЛьгота
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ТарифЛьгота,
		|	ВТ.СтимулирующийТариф,
		|	ВТ.КоличествоЧленовСемьи,
		|	ВТ.Услуга,
		|	ВТ.ЛицевойСчет,
		|	ВТ.Льгота,
		|	ВТ.ПотребительУслуг,
		|	ВТ.ПроцентЛьготы,
		|	ВТ.Тариф
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	Услуга,
		|	ДатаКонПериодаНазначения";
		
		Запрос.УстановитьПараметр("ТаблицаЛьгот",ТаблицаЛьгот);
		
		ТАбЛьготДляПоиска = Запрос.Выполнить().Выгрузить();
		
		
		Для каждого СтрокаТаблицыУслуг  Из Объект.Услуги Цикл
			
			Если СтрокаТаблицыУслуг.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ЛицевойСчет",СтрокаТаблицыУслуг.ЛицевойСчет);
				СтруктураПоиска.Вставить("Услуга",СтрокаТаблицыУслуг.Услуга);
				СтруктураПоиска.Вставить("ДатаНачПериодаНазначения",СтрокаТаблицыУслуг.ДатаНачПериодаНазначения);
				СтруктураПоиска.Вставить("ДатаКонПериодаНазначения",КонецДня(СтрокаТаблицыУслуг.ДатаКонПериодаНазначения));
				СтруктураПоиска.Вставить("ПотребительУслуг",СтрокаТаблицыУслуг.ПотребительУслуг);
				НайденнаяСтрока = ТАбЛьготДляПоиска.найтиСтроки(СтруктураПоиска);
				Если НайденнаяСтрока.Количество() <> 0 Тогда
					//Если НайденнаяСтрока[0].ДнейНачислено <> ДнейВМесяце Тогда
						СтрокаТаблицыУслуг.СуммаНачислено =  НайденнаяСтрока[0].СуммаЛьготы;
						СтрокаТаблицыУслуг.Количество =  НайденнаяСтрока[0].Количество;
					//КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
		
		КонецЦикла; 
		
		
		
	ИначеЕсли СтруктураДляРасчета.ЛицевыеСчета.Количество() = 1 Тогда	
		
		МассивСтрок = Объект.Услуги.НайтиСтроки(Новый Структура("ЛицевойСчет", СтруктураДляРасчета.ЛицевыеСчета[0]));
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл
			Объект.Услуги.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Для каждого СтрокаТаблицыУслуг Из ТаблицаУслуг Цикл
			НоваяСтрока = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыУслуг);
			Если СтрокаТаблицыУслуг.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
			    СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ЛицевойСчет",СтрокаТаблицыУслуг.ЛицевойСчет);
				СтруктураПоиска.Вставить("Услуга",СтрокаТаблицыУслуг.Услуга);
				СтруктураПоиска.Вставить("ДатаНачПериодаНазначения",СтрокаТаблицыУслуг.ДатаНачПериодаНазначения);
				СтруктураПоиска.Вставить("ДатаКонПериодаНазначения",СтрокаТаблицыУслуг.ДатаКонПериодаНазначения);
				СтруктураПоиска.Вставить("ПотребительУслуг",СтрокаТаблицыУслуг.ПотребительУслуг);
				НайденнаяСтрока = ТаблицаЛьгот.найтиСтроки(СтруктураПоиска);
				Если НайденнаяСтрока.Количество() <> 0 Тогда
					НоваяСтрока.СуммаНачислено =  НайденнаяСтрока[0].СуммаЛьготы;
					НоваяСтрока.Количество =  НайденнаяСтрока[0].Количество;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла; 
		
		МассивСтрок = Объект.Льготы.НайтиСтроки(Новый Структура("ЛицевойСчет", СтруктураДляРасчета.ЛицевыеСчета[0]));
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл
			Объект.Льготы.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Для каждого СтрокаТаблицыЛьгот Из ТаблицаЛьгот Цикл
			
			НоваяСтрока = Объект.Льготы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыЛьгот);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	Объект.СуммаДокумента = Объект.Услуги.Итог("СуммаНачислено");
	
КонецПроцедуры // РассчитатьСуммыНачислений()

// Процедура - рассчитывает начисления по лицевому счету.
//
&НаКлиенте
Процедура РассчитатьТекущийЛицевойСчет(Команда)
	
	СтрокаДеревоУслуг = Элементы.ДеревоУслуг.ТекущиеДанные;
	
	Если СтрокаДеревоУслуг = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Состояние(НСтр("ru='Идет расчет начислений ..."
"Пожалуйста, подождите.';uk='Йде розрахунок нарахувань ..."
"Будь ласка, почекайте.'"));
	
	ЗаполнитьТаблицуСортировкиЛС();

	РассчитатьСуммыНачислений(СтрокаДеревоУслуг.ЛицевойСчет);
	
	ПоказатьНачислениеУслуг( ,СтрокаДеревоУслуг.ЛицевойСчет);
	
	РазвернутьСтрокиДерева();	
	
	Состояние(НСтр("ru='Расчет начислений завершен.';uk='Розрахування нарахувань завершено'"));
	
КонецПроцедуры

// Процедура - рассчитывает начисления по всем лицевым счетам.
//
&НаКлиенте
Процедура РассчитатьВсеЛицевыеСчета(Команда)
	
	Состояние(НСтр("ru='Идет расчет начислений ..."
"Пожалуйста, подождите.';uk='Йде розрахунок нарахувань ..."
"Будь ласка, зачекайте.'"));
	
	ЗаполнитьТаблицуСортировкиЛС();

	РассчитатьСуммыНачислений();
	
	ПоказатьНачислениеУслуг();
	
	РазвернутьСтрокиДерева();	
	
	Состояние(НСтр("ru='Расчет начислений завершен.';uk='Розрахунок нарахувань завершений'"));
	
КонецПроцедуры

// Процедура - отображает начисления.
//
&НаСервере
Процедура ПоказатьНачислениеУслуг(МассивЛС = Неопределено, ТекущийЛС = Неопределено)
	
	ТаблицаУслуг = Объект.Услуги.Выгрузить();
	ТаблицаСортировкаЛС = СортировкаЛС.Выгрузить();	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
	Запрос.УстановитьПараметр("ТаблицаСортировкиЛС", ТаблицаСортировкаЛС);
	
	Запрос.УстановитьПараметр("МассивЛС", МассивЛС);
	Если МассивЛС = Неопределено Тогда
		Запрос.УстановитьПараметр("ЕстьОтбор", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ЕстьОтбор", Истина);
	КонецЕсли;	
		
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаУслуг.ЛицевойСчет,
		|	ТаблицаУслуг.Услуга,
		|	ТаблицаУслуг.СуммаНачислено,
		|	ТаблицаУслуг.ДнейНачислено,
		|	ТаблицаУслуг.Количество,
		|	ТаблицаУслуг.Тариф,
		|	ТаблицаУслуг.ДатаНачПериодаНазначения,
		|	ТаблицаУслуг.ДатаКонПериодаНазначения,
		|	ТаблицаУслуг.ВидНачисления,
		|	ТаблицаУслуг.ВидТарифа,
		|	ТаблицаУслуг.СтимулирующийТариф,
		|	ТаблицаУслуг.Порог,
		|	ТаблицаУслуг.ЗначениеПорога,
		|	ТаблицаУслуг.ПорогПорядок
		|ПОМЕСТИТЬ втТаблицаУслуг
		|ИЗ
		|	&ТаблицаУслуг КАК ТаблицаУслуг
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьОтбор = ИСТИНА
		|				ТОГДА ТаблицаУслуг.ЛицевойСчет В (&МассивЛС)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСортировкиЛС.ЛицевойСчет,
		|	ТаблицаСортировкиЛС.Порядок
		|ПОМЕСТИТЬ втСортировкаЛС
		|ИЗ
		|	&ТаблицаСортировкиЛС КАК ТаблицаСортировкиЛС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицевыеСчетаУслуги.ЛицевойСчет КАК ЛицевойСчет,
		|	ЛицевыеСчетаУслуги.Услуга КАК Услуга,
		|	ЛицевыеСчетаУслуги.СуммаНачислено КАК СуммаНачислено,
		|	ЛицевыеСчетаУслуги.ДнейНачислено,
		|	ЛицевыеСчетаУслуги.Количество,
		|	ЛицевыеСчетаУслуги.Тариф,
		|	ЛицевыеСчетаУслуги.ДатаНачПериодаНазначения,
		|	ЛицевыеСчетаУслуги.ДатаКонПериодаНазначения КАК ДатаКонПериодаНазначения,
		|	ЛицевыеСчетаУслуги.ВидНачисления КАК ВидНачисления,
		|	ЛицевыеСчетаУслуги.ВидТарифа КАК ВидТарифа,
		|	ЛицевыеСчетаУслуги.СтимулирующийТариф,
		|	ЛицевыеСчета.ОбъектЛицевогоСчета,
		|	Услуги.ВидУслуги КАК ВидУслуги,
		|	Услуги.ВидУслуги.Код КАК ВидУслугиКод,
		|	ЛицевыеСчета.Код,
		|	ЛицевыеСчета.Владелец КАК Здание,
		|	ЛицевыеСчета.ОбъектЛицевогоСчета.Код КАК ОбъектЛицевогоСчетаКод,
		|	СортировкаЛС.Порядок КАК Порядок,
		|	Услуги.ЕдиницаИзмерения,
		|	ЛицевыеСчетаУслуги.Порог,
		|	ЛицевыеСчетаУслуги.ЗначениеПорога,
		|	ЛицевыеСчетаУслуги.ПорогПорядок
		|ИЗ
		|	втТаблицаУслуг КАК ЛицевыеСчетаУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|		ПО ЛицевыеСчетаУслуги.ЛицевойСчет = ЛицевыеСчета.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги КАК Услуги
		|		ПО ЛицевыеСчетаУслуги.Услуга = Услуги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСортировкаЛС КАК СортировкаЛС
		|		ПО ЛицевыеСчетаУслуги.ЛицевойСчет = СортировкаЛС.ЛицевойСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ОбъектЛицевогоСчетаКод,
		|	ВидУслугиКод,
		|	Услуга,
		|	ВидНачисления,
		|	ДатаКонПериодаНазначения
		|ИТОГИ
		|	СУММА(СуммаНачислено)
		|ПО
		|	ЛицевойСчет,
		|	ВидУслуги,
		|	Услуга,
		|	ВидНачисления,
		|	ДатаКонПериодаНазначения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = РеквизитФормыВЗначение("ДеревоУслуг");
	Дерево.Строки.Очистить();
	
	ВыборкаЛицевойСчет = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛицевойСчет.Следующий() Цикл
		СтрокаУровень1 = Дерево.Строки.Добавить();
		СтрокаУровень1.СуммаНачислено = ВыборкаЛицевойСчет.СуммаНачислено;
		СтрокаУровень1.ЛицевойСчет = ВыборкаЛицевойСчет.ЛицевойСчет;
		СтрокаУровень1.КартинкаЛС = Истина;
		
		ДобавитьНаименование = Истина;
		
		ВыборкаВидУслуги = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидУслуги.Следующий() Цикл
			СтрокаУровень2 = СтрокаУровень1.Строки.Добавить();
			СтрокаУровень2.Наименование = ВыборкаВидУслуги.ВидУслуги;
			СтрокаУровень2.СуммаНачислено = ВыборкаВидУслуги.СуммаНачислено;
			СтрокаУровень2.ЛицевойСчет = ВыборкаЛицевойСчет.ЛицевойСчет;
		
			ВыборкаУслуга = ВыборкаВидУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаУслуга.Следующий() Цикл
				СтрокаУровень3 = СтрокаУровень2.Строки.Добавить();
				СтрокаУровень3.Наименование = ВыборкаУслуга.Услуга;
				СтрокаУровень3.СуммаНачислено = ВыборкаУслуга.СуммаНачислено;
				СтрокаУровень3.ЛицевойСчет = ВыборкаЛицевойСчет.ЛицевойСчет;
				
				Выборка = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ВидНачисления, ДатаКонПериодаНазначения,  ");
				
				ПредПорог = 0;
				ИтогКоличествоПороговое = 0;
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
						
						Если ДобавитьНаименование Тогда
						
							СтрокаУровень1.Наименование = Строка(ВыборкаЛицевойСчет.ЛицевойСчет) + " " + Строка(Выборка.ОбъектЛицевогоСчета) + " " + Строка(Выборка.Здание);
							
							ДобавитьНаименование = Ложь;
						
						КонецЕсли; 
						
						СтрокаУровень4 = СтрокаУровень3.Строки.Добавить();
						
						Если НЕ ЗначениеЗаполнено(Выборка.Порог) Тогда
							СтрокаУровень4.Наименование = "Период: "+ Формат(Выборка.ДатаНачПериодаНазначения, "ДФ=dd.MM.yyyy") + " - " + Формат(Выборка.ДатаКонПериодаНазначения, "ДФ=dd.MM.yyyy");	
						Иначе
							
							Если Выборка.Порог = Перечисления.ПорогиТарифовУслуг.Порог1 Тогда
								НаимПорога = НСтр("ru='За объем до %1 %2 включительно в месяц';uk='За обсяг до %1 %2 включно на місяць'");
							ИначеЕсли Выборка.ЗначениеПорога < 100000 Тогда
								НаимПорога = НСтр("ru='За объем свыше %3 %2 до %1 %2 включительно в месяц';uk='За обсяг понад %3 %2 до %1 %2 включно на місяць'");
							Иначе
								НаимПорога = НСтр("ru='За объем свыше %3 %2 в месяц';uk='За обсяг понад %3 %2 на місяць'");
							КонецЕсли;
		
							НаимПорога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НаимПорога,
										Выборка.ЗначениеПорога,
										Выборка.ЕдиницаИзмерения,
										ПредПорог);
							
							СтрокаУровень4.Наименование = НаимПорога;
							
							ПредПорог = Выборка.ЗначениеПорога;
						    ИтогКоличествоПороговое = ИтогКоличествоПороговое + Выборка.Количество;
						КонецЕсли; 
						
						СтрокаУровень4.СуммаНачислено = Выборка.СуммаНачислено;
						СтрокаУровень4.Количество = Выборка.Количество;
						СтрокаУровень4.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
						СтрокаУровень4.Тариф = Выборка.Тариф;
						СтрокаУровень4.ДнейНачислено = Выборка.ДнейНачислено;
						СтрокаУровень4.ВидНачисления = Выборка.ВидНачисления;
						Если Выборка.СтимулирующийТариф Тогда
							СтрокаУровень4.ВидТарифа = "Стимулирующий";
						Иначе
							СтрокаУровень4.ВидТарифа = Строка(Выборка.ВидТарифа);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				Если СтрокаУровень3.Строки.Количество() = 1 Тогда
					
					СтрокаУровень3.Количество = СтрокаУровень4.Количество;
					СтрокаУровень3.ЕдиницаИзмерения = СтрокаУровень4.ЕдиницаИзмерения;
					СтрокаУровень3.Тариф = СтрокаУровень4.Тариф;
					СтрокаУровень3.ДнейНачислено = СтрокаУровень4.ДнейНачислено;
					СтрокаУровень3.ВидНачисления = СтрокаУровень4.ВидНачисления;
					СтрокаУровень3.ВидТарифа = СтрокаУровень4.ВидТарифа;
					
					СтрокаУровень3.Строки.Очистить();
				Иначе
					СтрокаУровень3.Количество = ИтогКоличествоПороговое;
					СтрокаУровень3.ЕдиницаИзмерения = СтрокаУровень4.ЕдиницаИзмерения;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;

	ЗначениеВРеквизитФормы(Дерево, "ДеревоУслуг");	
	
	Если ТекущийЛС <> Неопределено Тогда 
		НайденныеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("ЛицевойСчет", ТекущийЛС));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			Элементы.ДеревоУслуг.ТекущаяСтрока = ДеревоУслуг.ПолучитьЭлементы().Получить(Дерево.Строки.Индекс(СтрокаДерева)).ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "Период".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисления 		= КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "Период".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	Если Объект.Услуги.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Услуги.Очистить();
		Объект.Льготы.Очистить();
		ПоказатьНачислениеУслуг();
		
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Истина;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "Период".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;	
	КонецЕсли;
	
	Если Объект.Услуги.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Услуги.Очистить();
		Объект.Льготы.Очистить();
		ПоказатьНачислениеУслуг();
		
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Истина;
		
	КонецЕсли;
	
	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
						
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Услуги.Очистить();
		Объект.Льготы.Очистить();
	КонецЕсли;
	
    Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТаблицаСортировки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Строка(Объект.Ссылка.УникальныйИдентификатор()), "Сортировка", , , Пользователи.ТекущийПользователь());
		Если ТипЗнч(ТаблицаСортировки) = Тип("ТаблицаЗначений") Тогда
		
			СортировкаЛС.Загрузить(ТаблицаСортировки);
		
		КонецЕсли; 
	КонецЕсли; 
	
	ПоказатьНачислениеУслуг();

	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьСтрокиДерева();
	
	Если Объект.Проведен Тогда
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Ложь;
	Иначе
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
	Если Объект.Проведен Тогда
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Ложь;
	Иначе
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Услуги.Количество() > 0 И НЕ Объект.Здание = ВыбранноеЗначение Тогда
		
		Ответ = Вопрос(НСтр("ru='Перед изменением табличная часть будет очищена. Продолжить?';uk='Перед зміною таблична частина буде очищена. Продовжити?'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Объект.Услуги.Очистить();
		Объект.Льготы.Очистить();
		ПоказатьНачислениеУслуг();
		
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Услуги.Количество() > 0 И НЕ Объект.Организация = ВыбранноеЗначение Тогда
		
		Ответ = Вопрос(НСтр("ru='Перед изменением табличная часть будет очищена. Продолжить?';uk='Перед зміною таблична частина буде очищена. Продовжити?'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Объект.Услуги.Очистить();
		Объект.Льготы.Очистить();
		ПоказатьНачислениеУслуг();
		
		Элементы.ЛицевыеСчетаГруппаЗаполнить.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

 &НаСервере
Функция ПолучитьСтруктуруЛСИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	ТаблицаДляЗагрузки.Свернуть("ЛицевойСчет",);
	Возврат ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет"); 
	
КонецФункции 

&НаКлиенте
Процедура НайтиЛС(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		МассивЛС = ПолучитьСтруктуруЛСИзХранилища(АдресЛицевыхСчетовВХранилище);
		
		ПоказатьНачислениеУслуг(МассивЛС);
		
		Элементы.Страницы.ТекущаяСтраница.Заголовок = "Лицевые счета (отбор)";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискЛС(Команда)
	
	ПоказатьНачислениеУслуг();

	Элементы.Страницы.ТекущаяСтраница.Заголовок = "Лицевые счета";

КонецПроцедуры

&НаКлиенте
Процедура ДеревоУслугПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.ДеревоУслуг.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.КартинкаЛС И ЗначениеЗаполнено(ТекущиеДанные.ЛицевойСчет) Тогда
		
			ОткрытьЗначение(ТекущиеДанные.ЛицевойСчет);
		
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	
	Если Элементы.ДеревоУслуг.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.ДеревоУслуг.ТекущиеДанные.КартинкаЛС Тогда
			Элементы.ДеревоУслуг.ТекущиеДанные.Признак = Истина;
			Элементы.ДеревоУслуг.Развернуть(Элементы.ДеревоУслуг.ТекущаяСтрока, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	#Если НЕ ВебКлиент Тогда
	
	СтрокиДерева = ДеревоУслуг.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиДерева Цикл
		Строка.Признак = Истина;
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоУслуг.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	Если Элементы.ДеревоУслуг.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.ДеревоУслуг.ТекущиеДанные.КартинкаЛС Тогда
			Если Элементы.ДеревоУслуг.Развернут(Элементы.ДеревоУслуг.ТекущаяСтрока) Тогда
				Элементы.ДеревоУслуг.ТекущиеДанные.Признак = Ложь;
				Элементы.ДеревоУслуг.Свернуть(Элементы.ДеревоУслуг.ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	#Если НЕ ВебКлиент Тогда
	
	СтрокиДерева = ДеревоУслуг.ПолучитьЭлементы();
	
	Для Каждого Строка Из СтрокиДерева Цикл
		Строка.Признак = Ложь;
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоУслуг.Свернуть(ИдентификаторСтроки);
	КонецЦикла;
	
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУслугПередРазворачиванием(Элемент, Строка, Отказ)
	
	ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	
	Если НЕ ДанныеСтроки = Неопределено Тогда
		ДанныеСтроки.Признак = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУслугПередСворачиванием(Элемент, Строка, Отказ)
	
	ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
	
	Если НЕ ДанныеСтроки = Неопределено Тогда
		ДанныеСтроки.Признак = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСортировкиЛС()

	Дерево = РеквизитФормыВЗначение("ДеревоУслуг");
	
    ТаблицаСортировкаЛС = СортировкаЛС.Выгрузить();
	Ном = 0;
	Для Каждого Строка Из Дерево.Строки Цикл
		Ном = Ном + 1;	
		ОтборСтрокСортировки = ТаблицаСортировкаЛС.НайтиСтроки(Новый Структура("ЛицевойСчет", Строка.ЛицевойСчет));
		Если ОтборСтрокСортировки.Количество() > 0 Тогда
			ОтборСтрокСортировки[0].Порядок = Ном;
			ОтборСтрокСортировки[0].Развернут = Строка.Признак;
		Иначе
			СтрокаСортировки = ТаблицаСортировкаЛС.Добавить();
			СтрокаСортировки.ЛицевойСчет = Строка.ЛицевойСчет;
			СтрокаСортировки.Порядок = Ном;
			СтрокаСортировки.Развернут = Строка.Признак;
		КонецЕсли; 
	КонецЦикла;

	СортировкаЛС.Загрузить(ТаблицаСортировкаЛС);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
    ПередЗакрытиемНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗаполнитьТаблицуСортировкиЛС();
		
		ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(Строка(Объект.Ссылка.УникальныйИдентификатор()), "Сортировка", СортировкаЛС.Выгрузить(), , Пользователи.ТекущийПользователь(), Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтрокиДерева()
	
	#Если НЕ ВебКлиент Тогда

	ОтборСтрокСортировки = СортировкаЛС.НайтиСтроки(Новый Структура("Развернут", Истина));
	МассивЛС = Новый Массив;
	Для каждого Строка Из ОтборСтрокСортировки Цикл
		МассивЛС.Добавить(Строка.ЛицевойСчет);
	КонецЦикла; 
	
	Если МассивЛС.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	СтрокиДерева = ДеревоУслуг.ПолучитьЭлементы();
	Для Каждого Строка Из СтрокиДерева Цикл
		
		Если НЕ МассивЛС.Найти(Строка.ЛицевойСчет) = Неопределено Тогда
			
			Строка.Признак = Истина;
			ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
			Элементы.ДеревоУслуг.Развернуть(ИдентификаторСтроки, Истина);
		
		КонецЕсли; 
		
	КонецЦикла;
	
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Услуги.Количество() = 0 и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'Таблица начисления услуг не заполнена. Докуент не будет проведен!'; uk = 'Таблиця нарахування послуг не заповнена. Докуент не буде проведений!'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
		
КонецПроцедуры
